<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"azurerm","backend":"f7d8df7d185a99cdc2ea3f28ad1b66e82139c82f94fea1d3e0701edcf74770f0","plan_job_ref":"Job ci cd #107 at https://github.com/HossainAhnaf/terraform/actions/runs/16233399795","plan_out_hash":"ceafc7f2c4267094c5de70527cd24b43ea706bfec4019ec50074b27e93efc6b5","plan_hash":"8374e0c9e5426feacd61d4bc9f2bde04669566236ece2f877fe670ea0b4bce8c","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __dev__ workspace
With var files: `dev.tfvars`
<details>
<summary>Plan: 16 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "centralus"
+       name     = "hossain-rg"
    }

  # azurerm_virtual_network.main will be created
+   resource "azurerm_virtual_network" "main" {
+       address_space                  = [
+           "10.0.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "centralus"
+       name                           = "hossain-vnet"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "hossain-rg"
+       subnet                         = (known after apply)
    }

  # module.backend.azurerm_app_service_virtual_network_swift_connection.backend will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "backend" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.backend.azurerm_subnet.backend_subnet will be created
+   resource "azurerm_subnet" "backend_subnet" {
+       address_prefixes                              = [
+           "10.0.2.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "hossain-backend-subnet"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "hossain-rg"
+       virtual_network_name                          = "hossain-vnet"

+       delegation {
+           name = "appServiceDelegation"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.database.azurerm_mysql_flexible_database.main will be created
+   resource "azurerm_mysql_flexible_database" "main" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "hossain-mysql-db"
+       resource_group_name = "hossain-rg"
+       server_name         = "hossain-mysql-flexible-server"
    }

  # module.database.azurerm_mysql_flexible_server.main will be created
+   resource "azurerm_mysql_flexible_server" "main" {
+       administrator_login           = "mysqladmin"
+       administrator_password        = (sensitive value)
+       administrator_password_wo     = (write-only attribute)
+       backup_retention_days         = 7
+       delegated_subnet_id           = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = true
+       id                            = (known after apply)
+       location                      = "centralus"
+       name                          = "hossain-mysql-flexible-server"
+       private_dns_zone_id           = (known after apply)
+       public_network_access         = (known after apply)
+       public_network_access_enabled = (known after apply)
+       replica_capacity              = (known after apply)
+       replication_role              = (known after apply)
+       resource_group_name           = "hossain-rg"
+       sku_name                      = "B_Standard_B1ms"
+       version                       = "8.0.21"
+       zone                          = (known after apply)

+       storage (known after apply)
    }

  # module.database.azurerm_private_dns_zone.server will be created
+   resource "azurerm_private_dns_zone" "server" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "privatelink.mysql.database.azure.com"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "hossain-rg"

+       soa_record (known after apply)
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.server will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "server" {
+       id                    = (known after apply)
+       name                  = "server-dns-link"
+       private_dns_zone_name = "privatelink.mysql.database.azure.com"
+       registration_enabled  = false
+       resource_group_name   = "hossain-rg"
+       virtual_network_id    = (known after apply)
    }

  # module.database.azurerm_private_endpoint.mysql_pe will be created
+   resource "azurerm_private_endpoint" "mysql_pe" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "centralus"
+       name                     = "hossain-mysql-flexible-server-pe"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "hossain-rg"
+       subnet_id                = (known after apply)

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "hossain-mysql-flexible-server-psc"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "mysqlServer",
            ]
        }
    }

  # module.database.azurerm_subnet.server_subnet will be created
+   resource "azurerm_subnet" "server_subnet" {
+       address_prefixes                              = [
+           "10.0.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "hossain-server-subnet"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "hossain-rg"
+       virtual_network_name                          = "hossain-vnet"

+       delegation {
+           name = "mysqlDelegation"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # module.backend.module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "hossain-linux-web-app-backend-asp"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "hossain-rg"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.backend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-hossain-linux-web-app-backend"
+       resource_group_name                 = "hossain-rg"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.backend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "hossain-linux-web-app-backend"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "hossain-rg"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

  # module.frontend.module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "hossain-linux-web-app-frontend-asp"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "hossain-rg"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.frontend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-hossain-linux-web-app-frontend"
+       resource_group_name                 = "hossain-rg"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.frontend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "hossain-linux-web-app-frontend"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "hossain-rg"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   database_name = "hossain-mysql-db"
+   project_name  = "spring-react-devops"
```
</details>

:memo: Plan generated in [ci cd #107](https://github.com/HossainAhnaf/terraform/actions/runs/16233399795)